app/controllers/emails_controller.rb

SELECT "emails".* FROM "emails"
---
  def index
    @emails = Email.all

SELECT "emails".* FROM "emails" WHERE "emails"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @email = Email.find(params[:id])